#+author: Nícolas André da Costa Morazotti
#+title: Lista 1
#+exclude_tags: noexport
#+options: toc:nil ':t
* Questão 9
O seu corpo é composto por prótons, nêutrons e elétrons. Estime o número
de elétrons e a carga negativa existente em seu corpo. /Sugestão: o/
/número de elétrons é igual ao de prótons. Para estimar o número de/
/prótons, suponha que ele é aproximadamente igual ao número de/
/nêutrons. Encontre na internet a massa do próton (praticamente igual à/
/do nêutron) e divida sua massa pela massa do próton multiplicada por/
/dois para encontrar o número de prótons./

#+BEGIN_SRC jupyter-python :exports results :results output :eval never-export :async yes  
  import numpy as np
  from pint import UnitRegistry
  import scipy.constants as consts

  ureg=UnitRegistry()

  minhaMassa = 83 * ureg.kilogram
  massaProton = consts.m_p * ureg.kilogram
  numberProton = (minhaMassa/massaProton)/2
  print(f'minha_massa = {minhaMassa} ')
  print(f'massa_proton = {massaProton:.3} ')
  print(f'n_protons = {numberProton:.3} = n_eletrons')
  cargaEletron = -consts.e * ureg.coulomb
  print(f'carga_eletron = {cargaEletron:.3}')
  print(f'carga_negativa_total = {numberProton*cargaEletron:.3}')
#+END_SRC

#+RESULTS:
: minha_massa = 83 kilogram 
: massa_proton = 1.67e-27 kilogram 
: n_protons = 2.48e+28 dimensionless = n_eletrons
: carga_eletron = -1.6e-19 coulomb
: carga_negativa_total = -3.98e+09 coulomb

* Questão 10
Suponha que houvesse um desequilíbrio e um em cada milhão dos seus
elétrons fosse parar em outra pessoa, a um quilômetro de distância. Qual
seria a força elétrica entre vocês dois?

Caso um a cada milhão de meus elétrons tenha saído de meu corpo,
teríamos um total de $2.48\cdot10^{22}$ elétrons fora de meu corpo, me
deixando com uma carga positiva de $Q=3.98\cdot10^3$ C. A outra pessoa
teria uma carga negativa de mesma intensidade. A força elétrica entre
nós seria
#+BEGIN_EXPORT latex
\begin{align*}
  F = -\frac{Q^2}{4\pi\varepsilon_0r^{2}}.
\end{align*}
#+END_EXPORT
Com $\varepsilon_0\approx8.85\cdot10^{-12}$ C^{2}N^{-1}m^{-2}, e a
distância $r=1$ km, tal força teria intensidade
#+BEGIN_SRC jupyter-python :session :exports results :results output :eval never-export :async t yes
  import numpy as np
  from pint import UnitRegistry
  import scipy.constants as consts

  ureg = UnitRegistry()
  carga = 3.98e3 * ureg.coulomb
  distancia = 1 * ureg.kilometer
  e0 = consts.epsilon_0 * ureg.coulomb**2 /(ureg.newton * ureg.meter**2)

  f = -carga*carga/(4*np.pi*e0*distancia*distancia)
  print(f'F = {f.to(ureg.newton):.3}')
#+END_SRC

#+RESULTS:
: F = -1.42e+11 newton

